Masmiseim36/nxpSDK/boards/frdmk64f/aws_examples/remote_control_wifi/pin_mux.h
/*
 * Copyright 2019 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTB21 (number 67), D12[3]/LEDRGB_BLUE
  @{ */
#define BOARD_INITPINS_LED_BLUE_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_LED_BLUE_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_LED_BLUE_PIN 21U    /*!<@brief PORTB pin index: 21 */
                                           /* @} */

/*! @name PORTB22 (number 68), D12[1]/LEDRGB_RED
  @{ */
#define BOARD_INITPINS_LED_RED_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_LED_RED_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_LED_RED_PIN 22U    /*!<@brief PORTB pin index: 22 */
                                          /* @} */

/*! @name PORTE26 (number 33), J2[1]/D12[4]/LEDRGB_GREEN
  @{ */
#define BOARD_INITPINS_LED_GREEN_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITPINS_LED_GREEN_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_LED_GREEN_PIN 26U    /*!<@brief PORTE pin index: 26 */
                                            /* @} */

/*! @name PORTA4 (number 38), SW3
  @{ */
#define BOARD_INITPINS_SW3_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_SW3_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_SW3_PIN 4U     /*!<@brief PORTA pin index: 4 */
                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTC3 (number 73), IRQ
  @{ */
#define BOARD_INITGT202SHIELD_IRQ_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITGT202SHIELD_IRQ_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITGT202SHIELD_IRQ_PIN 3U     /*!<@brief PORTC pin index: 3 */
                                             /* @} */

/*! @name PORTC12 (number 84), PWRON
  @{ */
#define BOARD_INITGT202SHIELD_PWRON_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITGT202SHIELD_PWRON_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITGT202SHIELD_PWRON_PIN 12U    /*!<@brief PORTC pin index: 12 */
                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitGT202Shield(void);

/*! @name PORTB9 (number 57), IRQ
  @{ */
#define BOARD_INITWIFI10CLICKSHIELD_IRQ_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITWIFI10CLICKSHIELD_IRQ_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITWIFI10CLICKSHIELD_IRQ_PIN 9U     /*!<@brief PORTB pin index: 9 */
                                                   /* @} */

/*! @name PORTC2 (number 72), PWRON
  @{ */
#define BOARD_INITWIFI10CLICKSHIELD_PWRON_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITWIFI10CLICKSHIELD_PWRON_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITWIFI10CLICKSHIELD_PWRON_PIN 2U     /*!<@brief PORTC pin index: 2 */
                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitWiFi10ClickShield(void);

/*! @name PORTB9 (number 57), IRQ
  @{ */
#define BOARD_INITSILEX2401SHIELD_IRQ_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITSILEX2401SHIELD_IRQ_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITSILEX2401SHIELD_IRQ_PIN 9U     /*!<@brief PORTB pin index: 9 */
                                                 /* @} */

/*! @name PORTC2 (number 72), PWRON
  @{ */
#define BOARD_INITSILEX2401SHIELD_PWRON_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITSILEX2401SHIELD_PWRON_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_INITSILEX2401SHIELD_PWRON_PIN 2U     /*!<@brief PORTC pin index: 2 */
                                                   /* @} */

/*! @name PORTA2 (number 36), KFET
  @{ */
#define BOARD_INITSILEX2401SHIELD_KFET_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITSILEX2401SHIELD_KFET_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITSILEX2401SHIELD_KFET_PIN 2U     /*!<@brief PORTA pin index: 2 */
                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSilex2401Shield(void);

/*! @name PORTE24 (number 31), J2[20]/U8[4]/I2C0_SCL
  @{ */
#define BOARD_I2C_CONFIGUREPINS_ACCEL_SCL_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_I2C_CONFIGUREPINS_ACCEL_SCL_PIN 24U    /*!<@brief PORTE pin index: 24 */
                                                     /* @} */

/*! @name PORTE25 (number 32), J2[18]/U8[6]/I2C0_SDA
  @{ */
#define BOARD_I2C_CONFIGUREPINS_ACCEL_SDA_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_I2C_CONFIGUREPINS_ACCEL_SDA_PIN 25U    /*!<@brief PORTE pin index: 25 */
                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_I2C_ConfigurePins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
